HomeWork103forEDT/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтавкиНДС</name>
  <enumValues>
    <name>БезНДС</name>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
  </enumValues>
  <enumValues>
    <name>НДС20</name>
  </enumValues>
</mdclass:Enum>

HomeWork103forEDT/src/CommonModules/НДСКлиентСервер/Module.bsl
Функция СуммаНДСПоСтавке(Сумма, СтавкаНДС) Экспорт 
	
	Перем ПроцентНДС;
	
	Если СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС") Тогда
		ПроцентНДС = 0;
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.ПустаяСсылка") Тогда
		ПроцентНДС = 0;
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10") Тогда
		ПроцентНДС = 10;
	Иначе	
		ПроцентНДС = 20;
	КонецЕсли;
	
	СуммаНДС = Сумма * ПроцентНДС * 0.01 / (1 + ПроцентНДС * 0.01);
	Возврат СуммаНДС;
	
КонецФункции
